Конфигурация/Catalogs/ДополнительныеОтчетыИОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДополнительныеОтчетыИОбработки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительныхОтчетовИОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенИнтерактивно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеВариантов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантЗапуска</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВызоваДополнительныхОбработок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказыватьОповещение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегламентноеЗаданиеGUID</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаПараметров</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скрыть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВсеТипы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Скриншоты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ДополнительныеОтчетыИОбработки/Ext/ObjectModule.bsl
Функция ПредставлениеЗадания(Команда)

	// "[ИмяОбъекта] (доп.) / [ПредставлениеКоманды]"
	Возврат
		СокрЛП(Наименование) + " (доп.) / " + СокрЛП(Команда.Представление) + " (" + Команда.ГруппаПараметровИмя + ")";
	
КонецФункции

Функция РасписаниеЗадано(Расписание)
	
	Возврат Строка(Расписание) <> Строка(Новый РасписаниеРегламентногоЗадания);
	
КонецФункции


Процедура ПередЗаписьюГлобальнойОбработки(Отказ)
	
	Если Отказ Или Не ДополнительныеСвойства.Свойство("АктуальныеКоманды") Тогда
		Возврат;
	КонецЕсли;
	
	АктуальныеКоманды = ДополнительныеСвойства.АктуальныеКоманды;
	
	ЗаданияДляОбновления = Новый Соответствие;
	ИзмененныеИНовыеКоманды = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Очистка заданий по командам, которые были удалены из таблицы
	Если Не ЭтотОбъект.ЭтоНовый() Тогда
		Для Каждого СтараяКоманда Из Ссылка.Команды Цикл
			Если ЗначениеЗаполнено(СтараяКоманда.РегламентноеЗаданиеGUID)
				И АктуальныеКоманды.Найти(СтараяКоманда.РегламентноеЗаданиеGUID, "РегламентноеЗаданиеGUID") = Неопределено
			Тогда
				Задание = РаботаСДополнительнымиОтчетамиИОбработками.НайтиЗадание(СтараяКоманда.РегламентноеЗаданиеGUID);
				Если Задание <> Неопределено Тогда
					РаботаСДополнительнымиОтчетамиИОбработками.УдалитьЗадание(Задание);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("АктуальныеКоманды", АктуальныеКоманды);
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	АктуальныеКоманды.Идентификатор КАК Идентификатор,
			|	АктуальныеКоманды.ГруппаПараметров КАК ГруппаПараметров,
			|	АктуальныеКоманды.ОбновитьЗадание КАК ОбновитьЗадание
			|ПОМЕСТИТЬ _АктуальныеКоманды
			|ИЗ
			|	&АктуальныеКоманды КАК АктуальныеКоманды
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_АктуальныеКоманды.Идентификатор КАК Идентификатор,
			|	_АктуальныеКоманды.ГруппаПараметров КАК ГруппаПараметров,
			|	_АктуальныеКоманды.ОбновитьЗадание
			|		ИЛИ ДополнительныеОтчетыИОбработкиКоманды.Идентификатор ЕСТЬ NULL КАК ОбновитьЗадание
			|ИЗ
			|	_АктуальныеКоманды КАК _АктуальныеКоманды
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
			|		ПО (ДополнительныеОтчетыИОбработкиКоманды.Ссылка = &Ссылка)
			|			И _АктуальныеКоманды.Идентификатор = ДополнительныеОтчетыИОбработкиКоманды.Идентификатор
			|			И _АктуальныеКоманды.ГруппаПараметров = ДополнительныеОтчетыИОбработкиКоманды.ГруппаПараметров
			|ГДЕ
			|	(_АктуальныеКоманды.ОбновитьЗадание
			|			ИЛИ ДополнительныеОтчетыИОбработкиКоманды.Идентификатор ЕСТЬ NULL)";
		
		ИзмененныеИНовыеКоманды = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	// Актуализация набора регламентных заданий для записи их идентификаторов в табличную часть.
	Для Каждого АктуальнаяКоманда Из АктуальныеКоманды Цикл
		
		Если ТипЗнч(ИзмененныеИНовыеКоманды) = Тип("ТаблицаЗначений") Тогда
			НайденныеСтроки = ИзмененныеИНовыеКоманды.НайтиСтроки(Новый Структура("Идентификатор, ГруппаПараметров", АктуальнаяКоманда.Идентификатор, АктуальнаяКоманда.ГруппаПараметров));
			Если НайденныеСтроки.Количество() = 0 Тогда
				// расписание не менялось, обновление команды не требуется
				Продолжить;
			КонецЕсли; 
		КонецЕсли; 
		
		НайденныеСтроки = ЭтотОбъект.Команды.НайтиСтроки(Новый Структура("Идентификатор, ГруппаПараметров", АктуальнаяКоманда.Идентификатор, АктуальнаяКоманда.ГруппаПараметров));
		
		Команда = НайденныеСтроки[0];
		
		Если АктуальнаяКоманда.РегламентноеЗаданиеИспользование И АктуальнаяКоманда.РегламентноеЗаданиеРасписание.Количество() > 0 Тогда
			Расписание    = АктуальнаяКоманда.РегламентноеЗаданиеРасписание[0].Значение;
			Использование = АктуальнаяКоманда.РегламентноеЗаданиеИспользование И РасписаниеЗадано(Расписание);
		Иначе
			Расписание    = Неопределено;
			Использование = Ложь;
		КонецЕсли;
		
		Задание = РаботаСДополнительнымиОтчетамиИОбработками.НайтиЗадание(АктуальнаяКоманда.РегламентноеЗаданиеGUID);
		
		Если Задание = Неопределено Тогда // Не найдено
			
			Если Использование Тогда
				Задание = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьНовоеЗадание(ПредставлениеЗадания(АктуальнаяКоманда));
				ЗаданияДляОбновления.Вставить(АктуальнаяКоманда, Задание);
				
				// Создать и зарегистрировать
				Команда.РегламентноеЗаданиеGUID = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьИдентификаторЗадания(Задание);
			КонецЕсли;
			
		Иначе // Найдено
			
			Если Использование Тогда
				// Зарегистрировать
				ЗаданияДляОбновления.Вставить(АктуальнаяКоманда, Задание);
			Иначе
				// Удалить
				РаботаСДополнительнымиОтчетамиИОбработками.УдалитьЗадание(Задание);
				Команда.РегламентноеЗаданиеGUID = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнительныеСвойства.Вставить("ЗаданияДляОбновления", ЗаданияДляОбновления);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПриЗаписиГлобальнойОбработки(Отказ)
	
	Если Отказ Или Не ДополнительныеСвойства.Свойство("АктуальныеКоманды") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого КлючИЗначение Из ДополнительныеСвойства.ЗаданияДляОбновления Цикл
		
		Команда = КлючИЗначение.Ключ;
		Задание = КлючИЗначение.Значение;
		
		Если Команда.РегламентноеЗаданиеРасписание.Количество() > 0 Тогда
			Расписание    = Команда.РегламентноеЗаданиеРасписание[0].Значение;
			Использование = Команда.РегламентноеЗаданиеИспользование И РасписаниеЗадано(Расписание);
		Иначе
			Расписание    = Неопределено;
			Использование = Ложь;
		КонецЕсли;
		
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(Ссылка);
		ПараметрыЗадания.Добавить(Команда.Идентификатор);
		ПараметрыЗадания.Добавить(Команда.ГруппаПараметров);
		ПараметрыЗадания.Добавить(Команда.ГруппаПараметровИмя);
		
		РаботаСДополнительнымиОтчетамиИОбработками.УстановитьПараметрыЗадания(
			Задание,
			Использование,
			Лев(ПредставлениеЗадания(Команда), 120),
			ПараметрыЗадания,
			Расписание);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПередУдалениемГлобальнойОбработки(Отказ)
	
	// Регламентные задание необходимо изменять в неразделенном режиме.
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Команда Из Команды Цикл
		
		Задание = РаботаСДополнительнымиОтчетамиИОбработками.НайтиЗадание(
			Команда.РегламентноеЗаданиеGUID);
			
		Если Задание <> Неопределено Тогда
			РаботаСДополнительнымиОтчетамиИОбработками.УдалитьЗадание(Задание);
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


Процедура ПередЗаписьюНазначаемойОбработки(Отказ)
	
	//ТаблицаНазначение = ЭтотОбъект.Назначение.Выгрузить();
	//ТаблицаНазначение.Свернуть("ОбъектНазначения");
	//ЭтотОбъект.Назначение.Загрузить(ТаблицаНазначение);
	//
	//ОбновлениеРегистраНазначение = Новый Структура("МассивСсылок");
	//
	//СсылкиОбъектовМетаданных = ТаблицаНазначение.ВыгрузитьКолонку("ОбъектНазначения");
	//
	//Если Не ЭтоНовый() Тогда
	//	Для Каждого СтрокаНазначение Из Ссылка.Назначение Цикл
	//		Если СсылкиОбъектовМетаданных.Найти(СтрокаНазначение.ОбъектНазначения) = Неопределено Тогда
	//			СсылкиОбъектовМетаданных.Добавить(СтрокаНазначение.ОбъектНазначения);
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	//
	//ДополнительныеСвойства.Вставить("СсылкиОбъектовМетаданных", СсылкиОбъектовМетаданных);
	
КонецПроцедуры

Процедура ПриЗаписиНазначаемойОбработки(Отказ)
	
	//Если Отказ Или Не ДополнительныеСвойства.Свойство("СсылкиОбъектовМетаданных") Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//РегистрыСведений.НазначениеДополнительныхОбработок.ОбновитьДанныеПоСсылкамОбъектовМетаданных(ДополнительныеСвойства.СсылкиОбъектовМетаданных);
	
КонецПроцедуры


Процедура ПроверитьЦелостностьСсылокНаПараметрыИГруппы(Отказ)
	
	// Выделим команды, ссылающиеся на отсутствующие группы
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеОтчетыИОбработкиКоманды.Представление КАК Команда
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки.ГруппыПараметров КАК ДополнительныеОтчетыИОбработкиГруппыПараметров
		|		ПО ДополнительныеОтчетыИОбработкиКоманды.ГруппаПараметров = ДополнительныеОтчетыИОбработкиГруппыПараметров.Идентификатор
		|			И ДополнительныеОтчетыИОбработкиКоманды.Ссылка = ДополнительныеОтчетыИОбработкиГруппыПараметров.Ссылка
		|ГДЕ
		|	ДополнительныеОтчетыИОбработкиКоманды.Ссылка = &Ссылка
		|	И ДополнительныеОтчетыИОбработкиКоманды.ГруппаПараметров <> &ПустойИдентификатор
		|	И ДополнительныеОтчетыИОбработкиГруппыПараметров.Идентификатор ЕСТЬ NULL ";
		
	Запрос.УстановитьПараметр("Ссылка",              ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ПустойИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствует группа параметров, на который ссылается команда '" + Выборка.Команда + "'",,,, Отказ);
	КонецЦикла;
	
	// Выделим параметры, ссылающиеся на отсутствующие группы
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеОтчетыИОбработкиПараметры.Имя КАК Параметр
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки.Параметры КАК ДополнительныеОтчетыИОбработкиПараметры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки.ГруппыПараметров КАК ДополнительныеОтчетыИОбработкиГруппыПараметров
		|		ПО ДополнительныеОтчетыИОбработкиПараметры.Группа = ДополнительныеОтчетыИОбработкиГруппыПараметров.Идентификатор
		|			И ДополнительныеОтчетыИОбработкиПараметры.Ссылка = ДополнительныеОтчетыИОбработкиГруппыПараметров.Ссылка
		|ГДЕ
		|	ДополнительныеОтчетыИОбработкиПараметры.Ссылка = &Ссылка
		|	И ДополнительныеОтчетыИОбработкиГруппыПараметров.Идентификатор ЕСТЬ NULL ";
		
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствует группа, на который ссылаются параметры",,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЦелостностьСсылокНаПараметрыИГруппы


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// критичные проверка
	Если ЭтотОбъект.ЭтоНовый() И Не РаботаСДополнительнымиОтчетамиИОбработками.ЕстьПравоИнтерактивнойРаботы() Тогда
		ВызватьИсключение НСтр("ru = 'Недостаточно прав для управления дополнительными отчетами и обработками'");
	КонецЕсли;
	
	Если ЭтотОбъект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	// блокирующие проверки
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		
		УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
		
		Если Не ЭтотОбъект.ЭтоНовый() И ЭтотОбъект.Вид <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Вид") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Невозможно сменить вид существующего дополнительного отчета или обработки'"),,,, Отказ);
			Возврат;
		КонецЕсли;
		
		// проверка конфликта имен
		Если РаботаСДополнительнымиОтчетамиИОбработками.НайтиКонфликтующиеИмена(ЭтотОбъект.ИмяОбъекта, ЭтотОбъект.Вид, ЭтотОбъект.Ссылка).Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Имя """ + ЭтотОбъект.ИмяОбъекта + """, используемое данным отчетом (обработкой), уже занято другим дополнительным отчетом (обработкой)'"),,,, Отказ);
			Возврат;
		КонецЕсли;
		
		АктуальныеКоманды = Неопределено;
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("АктуальныеКоманды", АктуальныеКоманды) Тогда
			
			АктуальныеКоманды.Колонки.Добавить("ГруппаПараметровСтрока", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
			АктуальныеКоманды.ЗагрузитьКолонку(АктуальныеКоманды.ВыгрузитьКолонку("ГруппаПараметров"), "ГруппаПараметровСтрока");
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Команды.НомерСтроки КАК НомерСтроки,
				|	Команды.Идентификатор КАК Идентификатор,
				|	Команды.ГруппаПараметровСтрока КАК ГруппаПараметров,
				|	ВЫРАЗИТЬ(Команды.ГруппаПараметровИмя КАК СТРОКА(25)) КАК ГруппаПараметровИмя
				|ПОМЕСТИТЬ _Команды
				|ИЗ
				|	&Команды КАК Команды
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	МАКСИМУМ(_Команды.НомерСтроки) КАК НомерСтроки,
				|	_Команды.Идентификатор КАК Идентификатор,
				|	_Команды.ГруппаПараметров КАК ГруппаПараметров,
				|	_Команды.ГруппаПараметровИмя КАК ГруппаПараметровИмя
				|ИЗ
				|	_Команды КАК _Команды
				|
				|СГРУППИРОВАТЬ ПО
				|	_Команды.Идентификатор,
				|	_Команды.ГруппаПараметров,
				|	_Команды.ГруппаПараметровИмя
				|
				|ИМЕЮЩИЕ
				|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _Команды.НомерСтроки) > 1";
			
			Запрос.УстановитьПараметр("Команды", АктуальныеКоманды);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ТекстОшибки = "Команда с идентификатором '" + Выборка.Идентификатор + "' с группой параметров '" + СокрЛП(Выборка.ГруппаПараметровИмя) + "' встречается более одного раза";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Команды[" + Выборка.НомерСтроки + "].Идентификатор",, Отказ);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// основной функционал
	Если РаботаСДополнительнымиОтчетамиИОбработками.ЭтоГлобальнаяОбработка(ЭтотОбъект.Вид) Тогда
		ПередЗаписьюГлобальнойОбработки(Отказ);
		//ЭтотОбъект.Назначение.Очистить();
	Иначе
		ПередЗаписьюНазначаемойОбработки(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ЭтотОбъект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если РаботаСДополнительнымиОтчетамиИОбработками.ЭтоГлобальнаяОбработка(ЭтотОбъект.Вид) Тогда
		ПередУдалениемГлобальнойОбработки(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	// блокирующие проверки
	ПроверитьЦелостностьСсылокНаПараметрыИГруппы(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// основной функционал
	Если РаботаСДополнительнымиОтчетамиИОбработками.ЭтоГлобальнаяОбработка(ЭтотОбъект.Вид) Тогда
		ПриЗаписиГлобальнойОбработки(Отказ);
	Иначе
		ПриЗаписиНазначаемойОбработки(Отказ);
	КонецЕсли;
	
КонецПроцедуры
